SensiEDGE/SensiLoRa2.0/Software/App/SensiLora-2.0/STM32CubeIDE/LoRaWAN/App/lora_app.c
/**
  ******************************************************************************
  * @file    lora_app.c
  * @author  MCD Application Team
  * @brief   Application of the LRWAN Middleware
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "platform.h"
#include "Region.h" /* Needed for LORAWAN_DEFAULT_DATA_RATE */
#include "sys_app.h"
#include "lora_app.h"
#include "stm32_timer.h"
#include "utilities_def.h"
#include "lora_app_version.h"
#include "lorawan_version.h"
#include "subghz_phy_version.h"
#include "lora_info.h"
#include "LmHandler.h"
#include "stm32_lpm.h"
#include "adc_if.h"
#include "sys_conf.h"
#include "CayenneLpp.h"
#include "sys_sensors.h"

/* USER CODE BEGIN Includes */
#include "FlashManager.h"
#include "SensiLoraBSP.h"
#include "usb_device.h"
/* USER CODE END Includes */

/* External variables ---------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private typedef -----------------------------------------------------------*/
/**
  * @brief LoRa State Machine states
  */
typedef enum TxEventType_e
{
  /**
    * @brief AppdataTransmition issue based on timer every TxDutyCycleTime
    */
  TX_ON_TIMER,
  /**
    * @brief AppdataTransmition external event plugged on OnSendEvent( )
    */
  TX_ON_EVENT
  /* USER CODE BEGIN TxEventType_t */

  /* USER CODE END TxEventType_t */
} TxEventType_t;

/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
uint8_t setTypeRegion(void);

static bool flagTxTimer;
static bool flagMac;
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private function prototypes -----------------------------------------------*/
/**
  * @brief  Off LED TX timer callback function
  * @param  timer context
  * @retval none
  */
static void OffTxTimerLedEvent(void *context);

/**
  * @brief  TX timer callback function
  * @param  timer context
  * @retval none
  */
static void TxTimerEvent(void *context);

/**
  * @brief  join event callback function
  * @param  params
  * @retval none
  */
static void OnJoinRequest(LmHandlerJoinParams_t *joinParams);

/**
  * @brief  tx event callback function
  * @param  params
  * @retval none
  */
static void OnTxData(LmHandlerTxParams_t *params);

/**
  * @brief callback when LoRa endNode has received a frame
  * @param appData
  * @param params
  * @retval None
  */
static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params);

/*!
 * Will be called each time a Radio IRQ is handled by the MAC layer
 *
 */
static void OnMacProcessNotify(void);

/**
 * @brief  Get Region LoRa with LoRaMacRegion_t
 * @param  None
 * @retval LoRaMacRegion_t
 */
static uint8_t getLoRaMacRegion(void);

/* USER CODE BEGIN PFP */
/**
  * @brief Timer to handle the application Tx Led to toggle
  */
static UTIL_TIMER_Object_t TxOffLedTimer;

/* USER CODE END PFP */

/* Private variables ---------------------------------------------------------*/
/**
  * @brief User application buffer
  */
static uint8_t AppDataBuffer[LORAWAN_APP_DATA_BUFFER_MAX_SIZE];

/**
  * @brief User application data structure
  */
static LmHandlerAppData_t AppData = { 0, 0, AppDataBuffer };

static ActivationType_t ActivationType = LORAWAN_DEFAULT_ACTIVATION_TYPE;

/**
  * @brief LoRaWAN handler Callbacks
  */
static LmHandlerCallbacks_t LmHandlerCallbacks =
{
        .GetBatteryLevel =           SystemApp_GetBatteryLevel,
        .GetTemperature =            SystemApp_GetTemperatureLevel,
        .GetUniqueId =               SystemApp_GetUniqueId,
        .GetDevAddr =                SystemApp_GetDevAddr,
        .OnMacProcess =              OnMacProcessNotify,
        .OnJoinRequest =             OnJoinRequest,
        .OnTxData =                  OnTxData,
        .OnRxData =                  OnRxData
};

/**
  * @brief LoRaWAN handler parameters
  */
static LmHandlerParams_t LmHandlerParams;

/**
  * @brief Specifies the state of the application LED
  */
static uint8_t AppLedStateOn = RESET;

/**
  * @brief Timer to handle the application Tx
  */
static UTIL_TIMER_Object_t TxTimer;


/* USER CODE BEGIN PV */
/* USER CODE END PV */

/* Exported functions ---------------------------------------------------------*/
/* USER CODE BEGIN EF */
/**
  * @brief  Handler LoRaWAN when USB com port disconnect
  * @param  None
  * @retval None
  */
void LoRaWAN_UsbDeActive(void)
{
    LmHandlerInit(&LmHandlerCallbacks);
    LmHandlerConfigure(&LmHandlerParams);
    LmHandlerJoin(ActivationType);
    UTIL_TIMER_Start(&TxTimer);
    BspLedOff(LED_GREEN);
}

/**
  * @brief  Handler LoRaWAN when USB com port connect
  * @param  None
  * @retval None
  */
void LoRaWAN_UsbActive(void)
{
    UTIL_TIMER_Stop(&TxOffLedTimer);
    UTIL_TIMER_Stop(&TxTimer);
    LmHandlerStop();
}

/**
  * @brief  Stop Timer LoRaWAN
  * @param  None
  * @retval None
  */
void LoRaWAN_StopTimer(void)
{
    UTIL_TIMER_Stop(&TxOffLedTimer);
    UTIL_TIMER_Stop(&TxTimer);
}
/* USER CODE END EF */

/**
  * @brief  Init Lora Application
  * @param  None
  * @retval None
  */
void LoRaWAN_Init(void)
{
  /* USER CODE BEGIN LoRaWAN_Init_1 */
  /*Convert Seconds to milliseconds */
  uint32_t timeTx = FlashManagerGetPeriodTime() * 1000;

  LmHandlerParams.ActiveRegion =    getLoRaMacRegion();
  LmHandlerParams.DefaultClass =    LORAWAN_DEFAULT_CLASS;
  LmHandlerParams.AdrEnable =       LORAWAN_ADR_STATE;
  LmHandlerParams.TxDatarate =      LORAWAN_DEFAULT_DATA_RATE;
  LmHandlerParams.PingPeriodicity = LORAWAN_DEFAULT_PING_SLOT_PERIODICITY;
  /* USER CODE END LoRaWAN_Init_1 */
  BspLedInit(LED_GREEN);

  /* Get LoRa APP version*/
  APP_LOG(TS_OFF, VLEVEL_M, "APP_VERSION:        V%X.%X.%X\r\n",
          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_MAIN_SHIFT),
          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_SUB1_SHIFT),
          (uint8_t)(__LORA_APP_VERSION >> __APP_VERSION_SUB2_SHIFT));

  /* Get MW LoraWAN info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_LORAWAN_VERSION: V%X.%X.%X\r\n",
          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_MAIN_SHIFT),
          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_SUB1_SHIFT),
          (uint8_t)(__LORAWAN_VERSION >> __APP_VERSION_SUB2_SHIFT));

  /* Get MW SubGhz_Phy info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_RADIO_VERSION:   V%X.%X.%X\r\n",
          (uint8_t)(__SUBGHZ_PHY_VERSION >> __APP_VERSION_MAIN_SHIFT),
          (uint8_t)(__SUBGHZ_PHY_VERSION >> __APP_VERSION_SUB1_SHIFT),
          (uint8_t)(__SUBGHZ_PHY_VERSION >> __APP_VERSION_SUB2_SHIFT));

  UTIL_TIMER_Create(&TxOffLedTimer, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OffTxTimerLedEvent, NULL);
  UTIL_TIMER_SetPeriod(&TxOffLedTimer, 100);

  /* Init Info table used by LmHandler*/
  LoraInfo_Init();
  /* Init the Lora Stack*/
  LmHandlerInit(&LmHandlerCallbacks);
  LmHandlerConfigure(&LmHandlerParams);
  LmHandlerJoin(ActivationType);

  BspLedOn(LED_RED);
  /* send every time timer elapses */
  UTIL_TIMER_Create(&TxTimer,  0xFFFFFFFFU, UTIL_TIMER_ONESHOT, TxTimerEvent, NULL);
  UTIL_TIMER_SetPeriod(&TxTimer, timeTx);
  UTIL_TIMER_Start(&TxTimer);
  /* USER CODE BEGIN LoRaWAN_Init_Last */

  /* USER CODE END LoRaWAN_Init_Last */
}

/* Private functions ---------------------------------------------------------*/
/* USER CODE BEGIN PrFD */
/* USER CODE END PrFD */

static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params)
{
  /* USER CODE BEGIN OnRxData_1 */
  if ((appData != NULL) || (params != NULL))
  {
    static const char *slotStrings[] = { "1", "2", "C", "C Multicast", "B Ping-Slot", "B Multicast Ping-Slot" };

    APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ========== MCPS-Indication ==========\r\n");
    APP_LOG(TS_OFF, VLEVEL_H, "###### D/L FRAME:%04d | SLOT:%s | PORT:%d | DR:%d | RSSI:%d | SNR:%d\r\n",
            params->DownlinkCounter, slotStrings[params->RxSlot], appData->Port, params->Datarate, params->Rssi, params->Snr);
    switch (appData->Port)
    {
      case LORAWAN_SWITCH_CLASS_PORT:
        /*this port switches the class*/
        if (appData->BufferSize == 1)
        {
          switch (appData->Buffer[0])
          {
            case 0:
            {
              LmHandlerRequestClass(CLASS_A);
              break;
            }
            case 1:
            {
              LmHandlerRequestClass(CLASS_B);
              break;
            }
            case 2:
            {
              LmHandlerRequestClass(CLASS_C);
              break;
            }
            default:
              break;
          }
        }
        break;
      case LORAWAN_USER_APP_PORT:
        if (appData->BufferSize == 1)
        {
          AppLedStateOn = appData->Buffer[0] & 0x01;
          if (AppLedStateOn == RESET)
          {
            APP_LOG(TS_OFF, VLEVEL_H,   "LED OFF\r\n");

            BspLedOff(LED_GREEN);
          }
          else
          {
            APP_LOG(TS_OFF, VLEVEL_H, "LED ON\r\n");

            BspLedOn(LED_GREEN);
          }
        }
        break;

      default:

        break;
    }
  }
  /* USER CODE END OnRxData_1 */
}

/**
  * @brief  Send Data to LoRaWAN
  * @param  None
  * @retval None
  */
void LoRaWAN_SendTxData(void)
{
  uint16_t vBat = SystemApp_GetBatteryLevel();
  uint16_t pressure = 0;
  int16_t temperature = 0;
  uint16_t humidity = 0;
  sensor_t sensor_data;
  UTIL_TIMER_Time_t nextTxIn = 0;
  uint32_t i = 0;
  /* USER CODE BEGIN SendTxData_1 */

  /* USER CODE END SendTxData_1 */

  Sensors_Enable();
  //Wait 200 ms to cut off raw data from sensors
  HAL_Delay(200);
  Sensors_Read(&sensor_data);
  Sensors_Disable();

  temperature = (int16_t) (sensor_data.temperature *100);

  pressure    = (uint16_t)(sensor_data.pressure * 10);      /* in hPa / 10 */

  AppData.Port = LORAWAN_USER_APP_PORT;

  humidity    = (uint16_t)(sensor_data.humidity * 100);            /* in %*10     */

  AppData.Buffer[i++] = (uint8_t)((pressure >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(pressure & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((temperature >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(temperature & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((humidity >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(humidity & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((sensor_data.accelAxes.AXIS_X >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(sensor_data.accelAxes.AXIS_X & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((sensor_data.accelAxes.AXIS_Y >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(sensor_data.accelAxes.AXIS_Y & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((sensor_data.accelAxes.AXIS_Z >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(sensor_data.accelAxes.AXIS_Z & 0xFF);

  AppData.Buffer[i++] = (uint8_t)((sensor_data.gyroAxes.AXIS_X >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(sensor_data.gyroAxes.AXIS_X & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((sensor_data.gyroAxes.AXIS_Y >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(sensor_data.gyroAxes.AXIS_Y & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((sensor_data.gyroAxes.AXIS_Z >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(sensor_data.gyroAxes.AXIS_Z & 0xFF);

  AppData.Buffer[i++] = (uint8_t)((sensor_data.magnetoAxes.AXIS_X >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(sensor_data.magnetoAxes.AXIS_X & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((sensor_data.magnetoAxes.AXIS_Y >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(sensor_data.magnetoAxes.AXIS_Y & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((sensor_data.magnetoAxes.AXIS_Z >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(sensor_data.magnetoAxes.AXIS_Z & 0xFF);

  AppData.Buffer[i++] = (uint8_t)((sensor_data.lights >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(sensor_data.lights & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((vBat >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(vBat & 0xFF);
  AppData.BufferSize = i;

  if (LORAMAC_HANDLER_SUCCESS == LmHandlerSend(&AppData, LORAWAN_DEFAULT_CONFIRMED_MSG_STATE, &nextTxIn, false))
  {
    APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST\r\n");
  }
  else if (nextTxIn > 0)
  {
    APP_LOG(TS_ON, VLEVEL_L, "Next Tx in  : ~%d second(s)\r\n", (nextTxIn / 1000));
  }
  /* USER CODE BEGIN SendTxData_2 */

  /* USER CODE END SendTxData_2 */
}

static void TxTimerEvent(void *context)
{
  /* USER CODE BEGIN TxTimerEvent */

  /* USER CODE END TxTimerEvent */
  flagTxTimer = true;
  UTIL_TIMER_Start(&TxTimer);
  /* USER CODE BEGIN TxTimerEvent */

  /* USER CODE END TxTimerEvent */
}

static void OffTxTimerLedEvent(void *context)
{
  /* USER CODE BEGIN OnTxTimerLedEvent_1 */

  /* USER CODE END OnTxTimerLedEvent_1 */
    BspLedOff(LED_GREEN);
  /* USER CODE BEGIN OnTxTimerLedEvent_2 */

  /* USER CODE END OnTxTimerLedEvent_2 */
}

static void OnTxData(LmHandlerTxParams_t *params)
{
  /* USER CODE BEGIN OnTxData_1 */

  /* USER CODE END OnTxData_1 */
  if ((params != NULL) && (params->IsMcpsConfirm != 0))
  {
    BspLedOn(LED_GREEN) ;
    UTIL_TIMER_Start(&TxOffLedTimer);

    APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ========== MCPS-Confirm =============\r\n");
    APP_LOG(TS_OFF, VLEVEL_H, "###### U/L FRAME:%04d | PORT:%d | DR:%d | PWR:%d", params->UplinkCounter,
            params->AppData.Port, params->Datarate, params->TxPower);

    APP_LOG(TS_OFF, VLEVEL_H, " | MSG TYPE:");
    if (params->MsgType == LORAMAC_HANDLER_CONFIRMED_MSG)
    {
      APP_LOG(TS_OFF, VLEVEL_H, "CONFIRMED [%s]\r\n", (params->AckReceived != 0) ? "ACK" : "NACK");
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_H, "UNCONFIRMED\r\n");
    }
  }

  /* USER CODE BEGIN OnTxData_2 */

  /* USER CODE END OnTxData_2 */
}

static void OnJoinRequest(LmHandlerJoinParams_t *joinParams)
{
  /* USER CODE BEGIN OnJoinRequest_1 */

  /* USER CODE END OnJoinRequest_1 */
  if (joinParams != NULL)
  {
    if (joinParams->Status == LORAMAC_HANDLER_SUCCESS)
    {
      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOINED = ");
      if (joinParams->Mode == ACTIVATION_TYPE_ABP)
      {
        APP_LOG(TS_OFF, VLEVEL_M, "ABP ======================\r\n");
      }
      else
      {
        APP_LOG(TS_OFF, VLEVEL_M, "OTAA =====================\r\n");
      }
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOIN FAILED\r\n");
    }
  }

  /* USER CODE BEGIN OnJoinRequest_2 */

  /* USER CODE END OnJoinRequest_2 */
}

static void OnMacProcessNotify(void)
{
  /* USER CODE BEGIN OnMacProcessNotify_1 */

  /* USER CODE END OnMacProcessNotify_1 */
    flagMac = true;
    /* USER CODE BEGIN OnMacProcessNotify_2 */

  /* USER CODE END OnMacProcessNotify_2 */
}

/**
  * @brief  Handler Task LoRa
  * @param  None
  * @retval None
  */
void LoRaWAN_HandlerTaskLoRa(void)
{
    if (flagTxTimer) {
        flagTxTimer = false;
        LoRaWAN_SendTxData();
    }

    if (flagMac) {
        flagMac = false;
        LmHandlerProcess();
    }
    if (isActiveUsb()) {
        SystemApp_UsbProcess();
    } else {
        if (!flagTxTimer && !flagMac) {
            SystemApp_Idle();
        }
    }
}

/**
 * @brief  Get Region LoRa with LoRaMacRegion_t
 * @param  None
 * @retval LoRaMacRegion_t
 */
uint8_t getLoRaMacRegion(void)
{
    uint32_t l_region = FlashManagerGetRegion();
    uint8_t l_reg = 0;

    switch(l_region) {
        case (1 << LORAMAC_REGION_AS923):
            l_reg = LORAMAC_REGION_AS923;
            break;
        case (1 << LORAMAC_REGION_AU915):
            l_reg = LORAMAC_REGION_AU915;
            break;
        case (1 << LORAMAC_REGION_EU868):
            l_reg = LORAMAC_REGION_EU868;
            break;
        case (1 << LORAMAC_REGION_KR920):
            l_reg = LORAMAC_REGION_KR920;
            break;
        case (1 << LORAMAC_REGION_IN865):
            l_reg = LORAMAC_REGION_IN865;
            break;
        case (1 << LORAMAC_REGION_US915):
            l_reg = LORAMAC_REGION_US915;
            break;
        default:
            l_reg = LORAMAC_REGION_EU868;
            break;
    }
    return l_reg;
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
